<?php	/*****************************************************	 **作者：张文晓	**创始时间：2017-04-12	**描述：报告下载service类。	*****************************************************/
require_once (dirname(dirname(dirname(__FILE__)))."/libraries/Includes.php");	class PDFService{		#.引用属性，每个控制器都需要有		private $includes;		private $model;		private $system;		private $session;
/**	 ***********************************************************	 *方法::PDFService::__construct	 * ----------------------------------------------------------	 *描述::报告下载service类初始化方法	 *----------------------------------------------------------	 *参数:	 *parm1:in--    无	 *----------------------------------------------------------	 *返回：	 *return:out--  无	 * ----------------------------------------------------------	 * 日期:2017.04.12  Add by zwx	 ************************************************************	 */
public function __construct(){		$this->includes=new Includes(__FILE__);		$this->includes->models("PDFModel");		$this->includes->libraries("CurrSystem");		$this->includes->libraries("CurrLog");		$this->includes->libraries("CurrSession");		$this->session=new CurrSession();		$this->system=new CurrSystem();		$this->model=new   PDFModel();	}	/**
	 ***********************************************************
	 *方法::PDFService::findList
	 * ----------------------------------------------------------
	 * 描述::获取报告下载列表
	 *----------------------------------------------------------
	 *参数:
	 *parm1:in--    无
	 *----------------------------------------------------------
	 *返回：
	 *return:out--  Array :: bool :: 返回数据列表
	 * ----------------------------------------------------------
	 * 日期:2017.04.12  Add by zwx
	 ************************************************************
	 */	public function findList($providerid,$modelid,$size,$startDate,$endDate){		return $this->model->findList($providerid,$modelid,$size,$startDate,$endDate);	}
	/**	 ***********************************************************	 *方法::PDFService::getPerson	 * ----------------------------------------------------------	 * 描述::报告下载获取车主比列	 *----------------------------------------------------------	 *参数:	 *parm1:in--    无	 *----------------------------------------------------------	 *返回：	 *return:out--  Array :: bool :: 返回数据列表	 * ----------------------------------------------------------	 * 日期:2017.04.12  Add by zwx	 ************************************************************	 */	public function getPerson($providerid,$y,$m){		$data=$this->model->getPerson($providerid,$y,$m);
		return $this->keys($data[0]);	}	/**
	 ***********************************************************
	 *方法::PDFService::getResult
	 * ----------------------------------------------------------
	 * 描述::报告下载获取门店总体评测得分
	 *----------------------------------------------------------
	 *参数:
	 *parm1:in--    无
	 *----------------------------------------------------------
	 *返回：
	 *return:out--  Array :: bool :: 返回数据列表
	 * ----------------------------------------------------------
	 * 日期:2017.04.12  Add by zwx
	 ************************************************************
	 */	public function getResult($modelid,$providerid,$y,$m){		$data=$this->model->getResult($modelid,$providerid,$y,$m);
		return $this->keys($data[0]);	}	/**
	 ***********************************************************
	 *方法::PDFService::getQuestionAvg
	 * ----------------------------------------------------------
	 * 描述::报告下载获取核心指标平均分
	 *----------------------------------------------------------
	 *参数:
	 *parm1:in--    无
	 *----------------------------------------------------------
	 *返回：
	 *return:out--  Array :: bool :: 返回数据列表
	 * ----------------------------------------------------------
	 * 日期:2017.04.12  Add by zwx
	 ************************************************************
	 */	public function getQuestionAvg($modelid,$providerid,$y,$m){		$data=$this->model->getQuestionAvg($modelid,$providerid,$y,$m);		return $this->keys($data[0]);	}	/**
	 ***********************************************************
	 *方法::PDFService::getQuestioni
	 * ----------------------------------------------------------
	 * 描述::报告下载获取是非题答案
	 *----------------------------------------------------------
	 *参数:
	 *parm1:in--    无
	 *----------------------------------------------------------
	 *返回：
	 *return:out--  Array :: bool :: 返回数据列表
	 * ----------------------------------------------------------
	 * 日期:2017.04.12  Add by zwx
	 ************************************************************
	 */	public function getQuestioni($providerid,$y,$m,$questionnaireid,$str){		$data=$this->model->getQuestioni($providerid,$y,$m,$questionnaireid,$str);		return $this->keys($data[0]);	}	/**
	 ***********************************************************
	 *方法::PDFService::getQuestioni
	 * ----------------------------------------------------------
	 * 描述::报告下载获取其他类型题目比例
	 *----------------------------------------------------------
	 *参数:
	 *parm1:in--    无
	 *----------------------------------------------------------
	 *返回：
	 *return:out--  Array :: bool :: 返回数据列表
	 * ----------------------------------------------------------
	 * 日期:2017.04.12  Add by zwx
	 ************************************************************
	 */	public function getQuestionAnswer($providerid,$y,$m,$questionnaireid,$str){
		return $this->setSizeC($this->model->getQuestionAnswer($providerid,$y,$m,$questionnaireid,$str),'size','content');	}	/**
	 ***********************************************************
	 *方法::PDFService::getQi
	 * ----------------------------------------------------------
	 * 描述::报告下载获取模块详情分类平均分
	 *----------------------------------------------------------
	 *参数:
	 *parm1:in--    无
	 *----------------------------------------------------------
	 *返回：
	 *return:out--  Array :: bool :: 返回数据列表
	 * ----------------------------------------------------------
	 * 日期:2017.04.12  Add by zwx
	 ************************************************************
	 */	public function getQi($modelid,$providerid,$y,$m,$questionnaireid){		return $this->model->getQi($modelid,$providerid,$y,$m,$questionnaireid);	}	/**
	 ***********************************************************
	 *方法::PDFService::getProvider
	 * ----------------------------------------------------------
	 * 描述::报告下载获取门店商户详情
	 *----------------------------------------------------------
	 *参数:
	 *parm1:in--    无
	 *----------------------------------------------------------
	 *返回：
	 *return:out--  Array :: bool :: 返回数据列表
	 * ----------------------------------------------------------
	 * 日期:2017.04.12  Add by zwx
	 ************************************************************
	 */	public function getProvider($id){		$data=$this->model->getProvider($id);		return $data[0];	}	/**
	 ***********************************************************
	 *方法::PDFService::getModels
	 * ----------------------------------------------------------
	 * 描述::报告下载获取调研模块列表
	 *----------------------------------------------------------
	 *参数:
	 *parm1:in--    无
	 *----------------------------------------------------------
	 *返回：
	 *return:out--  Array :: bool :: 返回数据列表
	 * ----------------------------------------------------------
	 * 日期:2017.04.12  Add by zwx
	 ************************************************************
	 */	public function getModels($modelid){		return $this->model->getModels($modelid);	}	/**	 ***********************************************************	 *方法::PDFService::keys	 * ----------------------------------------------------------	 * 描述::分离数组方法	 *----------------------------------------------------------	 *参数:	 *parm1:in--    无	 *----------------------------------------------------------	 *返回：	 *return:out--  Array :: bool :: 返回数据列表	 * ----------------------------------------------------------	 * 日期:2017.04.12  Add by zwx	 ************************************************************	 */
	public function keys($list){
		$data=array('key'=>array(),'val'=>array());
		foreach($list as $key=>$val){			$data['key'][]=$key;
			$data['val'][]=$val;
		}
		return $data;
 	}	/**	 ***********************************************************	 *方法::PDFService::setSizeC	 * ----------------------------------------------------------	 * 描述::数据整合方法	 *----------------------------------------------------------	 *参数:	 *parm1:in--    无	 *----------------------------------------------------------	 *返回：	 *return:out--  Array :: bool :: 返回数据列表	 * ----------------------------------------------------------	 * 日期:2017.04.12  Add by zwx	 ************************************************************	 */
 	function setSizeC($list,$type,$title){
 		$data=array('key'=>array(),'val'=>array());
 		$sum=0;
 		for($i=0;$i<count($list);$i++){
 			$sum+=$list[$i][$type];
 		}
 		$data['name']=$list[0]['name'];
 		for($i=0;$i<count($list);$i++){
 			$data['key'][]=$list[$i][$title];
 			$data['val'][]=round(($list[$i][$type]/$sum),4)*100;
 		}
 		return $data;
 	}
}