<?php
/*****************************************************
 **作者：张文晓
**创始时间：2017-01-10
**描述：通用加密解密类，包含MD5加密，
*				和BASE64加解密和验证。
*****************************************************/
class CurrEncode{
	#.base64加密key地址
	private $fileUrl='';
	public function __construct(){
		$this->fileUrl=dirname(__FILE__).'/Key.txt';
	}
	/**
	 ***********************************************************
	 *方法::CurrEncode::getMd5
	 * ----------------------------------------------------------
	 * 描述::加密类获取md5加密方法
	 *----------------------------------------------------------
	 *参数:
	 *parm1:in--   String : str              :: 需要加密的字符串
	 *----------------------------------------------------------
	 *返回：
	 *return:out--  String : str             :: 已经加密的字符串
	 * ----------------------------------------------------------
	 *示例:
	 *case1:use--   getMd5($str='password')
	 *----------------------------------------------------------
	 * 日期:2017.01.10  Add by zwx
	 ************************************************************
	 */
	function getMd5($str=''){
		($str!='') && $str=md5($str);
		return  $str;
	}
	/**
	 ***********************************************************
	 *方法::CurrEncode::checkMd5
	 * ----------------------------------------------------------
	 * 描述::验证MD5方法
	 *----------------------------------------------------------
	 *参数:
    *parm1:in--    String : str1    :: 需要验证的MD5字符串
	 *parm2:in--   String : str2    :: 需要验证的MD5字符串
	 *----------------------------------------------------------
	 *返回：
	 *return:out--  bool : bool     :: 验证结果
	 * ----------------------------------------------------------
	 *示例:
	 *case1:use--   checkMd5('ASDFGH','BCDFGH')
	 *----------------------------------------------------------
	 * 日期:2017.01.10  Add by zwx
	 ************************************************************
	 */
	function checkMd5($str1,$str2){
		$bool=false;
		($str1==$str2) && $bool=true;
		return $bool;
	}
	/**
	 ***********************************************************
	 *方法::CurrEncode::getBase64
	 * ----------------------------------------------------------
	 * 描述::获取base64加密算法
	 *----------------------------------------------------------
	 *参数:
	 *parm1:in--   String : str    :: 需要加密的字符串
	 *----------------------------------------------------------
	 *返回：
	 *return:out--  String : str    :: 已经加密的字符串  
	 * ----------------------------------------------------------
	 *示例:
	 *case1:use--    getBase64($str='token')
	 *----------------------------------------------------------
	 * 日期:2017.01.10  Add by zwx
	 ************************************************************
	 */
	function getBase64($str=''){
		$handle=fopen($this->fileUrl, "r");
		$keys=fread($handle, filesize($this->fileUrl));
		fclose($handle);
		($str!='') && $str=base64_encode($str.'|'.$keys);
		return $str;
	}
	/**
	 ***********************************************************
	 *方法::CurrEncode::getDecode
	 * ----------------------------------------------------------
	 * 描述::解密base64方法
	 *----------------------------------------------------------
	 *参数:
	 *parm1:in--   String : str    :: 需要解密的字符串
	 *----------------------------------------------------------
	 *返回：
	 *return:out--  String : str    :: 已经解密的字符串
	 * ----------------------------------------------------------
	 *示例:
	 *case1:use--    getDecode('ASDFGHJKL')
	 *----------------------------------------------------------
	 * 日期:2017.01.10  Add by zwx
	 ************************************************************
	 */
	function getDecode($str=''){
		($str!='') && $str=base64_decode($str);
		$handle=fopen($this->fileUrl, "r");
		$keys=fread($handle, filesize($this->fileUrl));
		fclose($handle);
	    $check=explode('|',$str);
	    (count($check)>1 && $check[1]==$keys) && $str=$check[0];
		return $str;
	}
	/**
	 ***********************************************************
	 *方法::CurrEncode::checkBase64
	 * ----------------------------------------------------------
	 * 描述::验证base64方法
	 *----------------------------------------------------------
	 *参数:
     *parm1:in--    String : str1    :: 需要验证的字符串
	 *parm2:in--   String : str2    :: 需要验证的字符串
	 *----------------------------------------------------------
	 *返回：
	 *return:out--  bool : bool     :: 验证结果
	 * ----------------------------------------------------------
	 *示例:
	 *case1:use--   checkMd5('ASDFGH','BCDFGH')
	 *----------------------------------------------------------
	 * 日期:2017.01.10  Add by zwx
	 ************************************************************
	 */
	function checkBase64($str1,$str2){
		$bool=false;
		!empty($str1) && $str=base64_decode($str1);
		!empty($str2) && $str=base64_decode($str2);
		$handle=fopen($this->fileUrl, "r");
		$keys=fread($handle, filesize($this->fileUrl));
		fclose($handle);
		$check1=explode('|',$str1);
		$check2=explode('|',$str2);
		(count($check1)>1 && $check1[1]==$keys) && $str1=$check1[0];
		(count($check2)>1 && $check2[1]==$keys) && $str2=$check2[0];
		($str1==$str2) && $bool=true;
		return $bool;
	}
}